pos/admin/app/Controllers/Clubadmin.php

    public function addNewStringing()
    {
        $club_id = session()->get('user_id');

        $inventoryModel = new InventoryModel();
        $dataP['inventory_list'] = $inventoryModel->select('name, id')->where('club_id', $club_id)->findAll();
---
SELECT `name`, `id`
FROM `hy_inventory`
WHERE `club_id` = '1'

    public function listStringing()
    {
        $model = new StringModel();
        $club_id = session()->get('user_id');
        // $getStringDetails = $model->getStringingByClub($club_id);
        $db = db_connect();
        $builder = $db->table('hy_stringing');
        $builder->select('hy_stringing.*, hy_inventory.name as inventory_name');
        $builder->join('hy_inventory', 'hy_inventory.id = hy_stringing.which_string', 'left');
        $builder->where('hy_stringing.club_id', $club_id);
        $query = $builder->get();
---
SELECT `hy_stringing`.*, `hy_inventory`.`name` as `inventory_name`
FROM `hy_stringing`
LEFT JOIN `hy_inventory` ON `hy_inventory`.`id` = `hy_stringing`.`which_string`
WHERE `hy_stringing`.`club_id` = '1'

    public function editStringing($string_id = "")
    {
        $stringModel = new StringModel();

        $club_id = session()->get('user_id');

        $inventoryModel = new InventoryModel();
        $data['inventory_list'] = $inventoryModel->select('name, id')->where('club_id', $club_id)->findAll();
---
SELECT `name`, `id`
FROM `hy_inventory`
WHERE `club_id` = '1'