pos/admin/app/Models/InventoryModel.php

SELECT *
FROM `hy_inventory`
WHERE `id` = '2'
 LIMIT 1
---
    public function getInventoryDetailsById($id)
    {
        return $this->where('id', $id)->first();