pos/admin/app/Models/MembershipModel.php

SELECT *
FROM `hy_membership`
WHERE `unique_id` = 'HA000001'
---
    public function getUserDetailsByMembershipId($membershipId)
    {
        // Query the database to get user details based on the membership ID
        $builder = $this->db->table('hy_membership');
        $builder->where('unique_id', $membershipId);
        $query = $builder->get();

SELECT *
FROM `hy_membership`
WHERE `phone` = '1234567890'
---
    public function getUserDetailsByMembershipPhone($membershipPhone)
    {
        // Query the database to get user details based on the membership ID
        $builder = $this->db->table('hy_membership');
        $builder->where('phone', $membershipPhone);
        $query = $builder->get();